Repository: astralchen/QuickLayoutKit
Catalog: Demo/Demo/Localizable.xcstrings
Source language: en
Languages: ar, zh_hans

# localization.overview.body
source: This page shows language selection, follow-system behavior, and the effective layout direction used by the Demo.
ar: هذه الصفحة تعرض اختيار اللغة، تتبع النظام، والاتجاه الفعلي المستخدم في Demo.
zh_hans: 这个页面展示语言选择、跟随系统和 Demo 当前生效的布局方向。

# main.search.empty.description
source: Try another example name or category.
ar: جرّب اسم مثال أو فئة أخرى.
zh_hans: 试试其他示例名称或分类。

# main.search.empty.title
source: No Results
ar: لا توجد نتائج
zh_hans: 没有找到相关示例

# main.search.placeholder
source: Search examples
ar: البحث في الأمثلة
zh_hans: 搜索示例

# main.section.hosting
source: Controller Hosting
ar: استضافة وحدات التحكم
zh_hans: 控制器宿主

# main.section.localization
source: Localization Examples
ar: أمثلة الترجمة
zh_hans: 语言切换示例

# main.section.quicklayout
source: QuickLayout Examples
ar: أمثلة QuickLayout
zh_hans: QuickLayout 示例

# main.title
source: Examples
ar: الأمثلة
zh_hans: 示例

# navigation.body
source: In RTL, the back icon and interactive pop edge move to the right.
ar: عند RTL يتحول زر الرجوع والحافة التفاعلية إلى اليمين.
zh_hans: 切到 RTL 后，返回图标和 interactive pop 边缘会移动到右侧。

# navigation.edge.left
source: left
ar: اليسار
zh_hans: 左侧

# navigation.edge.right
source: right
ar: اليمين
zh_hans: 右侧

# navigation.edge.summary
source: Back edge: %@, chevron: %@
ar: حافة الرجوع: %@، علامة الاتجاه: %@
zh_hans: 返回边缘：%@，箭头：%@

# navigation.leading
source: Leading Item
ar: عنصر البداية
zh_hans: Leading 按钮

# navigation.trailing
source: Trailing Item
ar: عنصر النهاية
zh_hans: Trailing 按钮

# positionAndZIndex.intro
source: This page shows how elements are placed inside the proposed space and how overlapping elements are ordered.
ar: توضح هذه الصفحة موضع العناصر داخل المساحة المقترحة وكيفية ترتيب العناصر المتداخلة.
zh_hans: 这个页面演示元素在建议空间内的定位方式，以及重叠元素的显示顺序。

# positionAndZIndex.position.description
source: position places an element's center at a physical coordinate, so the points stay unchanged in LTR and RTL layouts.
ar: يضع position مركز العنصر عند إحداثي فعلي. لذلك تبقى النقاط نفسها في تخطيطي LTR وRTL.
zh_hans: position 将元素中心放到物理坐标点，因此切换 LTR 与 RTL 时这些坐标保持不变。

# positionAndZIndex.zIndex.description
source: Higher values appear in front. B is declared before C, but zIndex(3) still places B above C.
ar: تظهر القيمة الأكبر في المقدمة. تم تعريف B قبل C، لكن zIndex(3) يضع B فوق C.
zh_hans: 数值越大，显示层级越靠前。B 虽然在 C 之前声明，但 zIndex(3) 仍使 B 位于 C 上方。

# profile.action.message
source: Message
ar: مراسلة
zh_hans: 发消息

# profile.action.portfolio
source: Portfolio
ar: معرض الأعمال
zh_hans: 作品集

# profile.activity.detail
source: Language switching, RTL scrolling, and keyboard avoidance are active inside the demo.
ar: تبديل اللغة، التمرير في RTL، وتجنب لوحة المفاتيح تعمل مباشرة داخل العرض.
zh_hans: 语言切换、RTL 滚动和键盘避让都已在 Demo 中实时运行。

# profile.activity.title
source: Shipped a localized QuickLayout demo
ar: أطلق تجربة QuickLayout موطّنة
zh_hans: 交付了本地化 QuickLayout Demo

# profile.availability
source: Available for UIKit product work
ar: متاح لمشاريع UIKit
zh_hans: 可参与 UIKit 产品项目

# profile.bio
source: Builds practical UIKit interfaces with QuickLayout, focusing on runtime localization, RTL support, and keyboard-aware form experiences.
ar: يبني واجهات UIKit عملية باستخدام QuickLayout، مع اهتمام بتبديل اللغة وقت التشغيل، دعم RTL، وتجارب النماذج المتجاوبة مع لوحة المفاتيح.
zh_hans: 使用 QuickLayout 构建实用的 UIKit 界面，关注运行时语言切换、RTL 支持和键盘响应式表单体验。

# profile.location
source: Shanghai · Remote
ar: شنغهاي · عن بعد
zh_hans: 上海 · 远程协作

# profile.name
source: John Doe
ar: جون دو
zh_hans: 张三

# profile.role
source: QuickLayout/UIKit Integration Designer
ar: مصمم تكامل QuickLayout و UIKit
zh_hans: QuickLayout/UIKit 集成设计师

# profile.section.about
source: About
ar: نبذة
zh_hans: 简介

# profile.section.activity
source: Recent Activity
ar: النشاط الأخير
zh_hans: 最近动态

# profile.section.skills
source: Skills
ar: المهارات
zh_hans: 能力标签

# profile.skill.accessibility
source: Accessibility
ar: إمكانية الوصول
zh_hans: 无障碍

# profile.skill.collection
source: Collection Views
ar: القوائم
zh_hans: 列表布局

# profile.skill.controllerHosting
source: Controller Hosting
ar: استضافة المتحكم
zh_hans: 控制器宿主

# profile.skill.dynamicType
source: Dynamic Type
ar: الخط الديناميكي
zh_hans: 动态字体

# profile.skill.keyboard
source: Keyboard
ar: لوحة المفاتيح
zh_hans: 键盘避让

# profile.skill.localization
source: Localization
ar: التوطين
zh_hans: 本地化

# profile.skill.scroll
source: Scroll Views
ar: التمرير
zh_hans: 滚动视图

# profile.stats.followers.title
source: Followers
ar: متابعون
zh_hans: 关注者

# profile.stats.projects.title
source: Projects
ar: المشاريع
zh_hans: 项目

# profile.stats.response.title
source: Response
ar: الاستجابة
zh_hans: 响应

# representable.child.button
source: Child Button
ar: زر Child
zh_hans: Child 按钮

# representable.child.subtitle
source: UIViewController containment
ar: احتواء UIViewController
zh_hans: UIViewController 容器联动

# representable.child.title
source: Child Controller %@
ar: وحدة تحكم Child %@
zh_hans: Child 控制器 %@

# representable.hide
source: Hide Host
ar: إخفاء Host
zh_hans: 隐藏 Host

# representable.preferredSize
source: Toggle Preferred Size
ar: تغيير الحجم المفضل
zh_hans: 切换 preferredContentSize

# representable.replace
source: Replace Loaded Child
ar: استبدال الطفل
zh_hans: 替换已加载 Child

# representable.reset
source: Reset LazyView
ar: إعادة LazyView
zh_hans: 重置 LazyView

# representable.showAgain
source: Show Again
ar: إظهار مجدداً
zh_hans: 再次显示

# representable.showLazy
source: Show Lazy A
ar: إظهار Lazy A
zh_hans: 显示 Lazy A

# safeAreaPadding.intro
source: Switch combinations and rotate the device to inspect the safe-area boundary. The dashed green line marks the current safe area, while the values report the page frame.
ar: بدّل بين التركيبات ودوّر الجهاز لمراقبة حدود المنطقة الآمنة. يوضح الخط الأخضر المتقطع المنطقة الآمنة الحالية، وتعرض القيم الإطار الفعلي للصفحة.
zh_hans: 切换不同组合并旋转设备，观察安全区域边界。绿色虚线表示当前安全区域，下方数值显示页面最终 frame。

# safeAreaPadding.next
source: Next combination
ar: التركيبة التالية
zh_hans: 下一个组合

# safeAreaPadding.previous
source: Previous combination
ar: التركيبة السابقة
zh_hans: 上一个组合

# semantic.avatar
source: Avatar and description
ar: الصورة الرمزية والوصف
zh_hans: 头像和描述文字

# semantic.header.subtitle
source: Compare left-to-right and right-to-left layout in the same containers.
ar: قارن بين LTR و RTL في الحاويات نفسها.
zh_hans: 观察 forceLeftToRight 和 forceRightToLeft 的布局差异

# semantic.header.title
source: UISemanticContentAttribute Demo
ar: عرض UISemanticContentAttribute
zh_hans: UISemanticContentAttribute 演示

# semantic.ltr
source: 2. Force Left-to-Right
ar: 2. إجبار LTR

# semantic.next
source: Next
ar: التالي
zh_hans: 下一步

# semantic.phone
source: Phone icon
ar: أيقونة الهاتف
zh_hans: 手机图标

# semantic.rtl
source: 3. Force Right-to-Left
ar: 3. إجبار RTL

# semantic.unspecified
source: 1. Unspecified
ar: 1. غير محدد
zh_hans: 1. Unspecified (默认)

# swiftui.bridge.body
source: This example uses UIHostingController to read locale and layoutDirection from AppLocalization.
ar: يستخدم هذا المثال UIHostingController لقراءة locale و layoutDirection من AppLocalization.
zh_hans: 这个示例用 UIHostingController 读取 AppLocalization 的 locale 和 layoutDirection。

# swiftui.sheet.message
source: This sheet inherits locale and layout direction from the root.
ar: هذا sheet يرث اللغة والاتجاه من الجذر.
zh_hans: 这个 sheet 会继承根部注入的语言和布局方向。

# swiftui.showSheet
source: Show SwiftUI Sheet
ar: عرض SwiftUI Sheet
zh_hans: 显示 SwiftUI Sheet

# uikit.collection.1
source: Item 1
ar: عنصر 1
zh_hans: 项目 1

# uikit.collection.2
source: Item 2
ar: عنصر 2
zh_hans: 项目 2

# uikit.collection.3
source: Item 3
ar: عنصر 3
zh_hans: 项目 3

# uikit.modal.message
source: This presented controller receives reload calls from the scene coordinator.
ar: هذا presented controller يتلقى reload من scene coordinator.
zh_hans: 这个 presented controller 会收到 scene coordinator 的刷新调用。

# uikit.showcase.subtitle
source: UILabel, UIButton, and UICollectionView refresh through UIKit reload protocols.
ar: UILabel و UIButton و UICollectionView يتم تحديثها عبر بروتوكولات UIKit.
zh_hans: UILabel、UIButton 和 UICollectionView 通过 UIKit reload 协议刷新。

# uikit.showModal
source: Show Modal
ar: عرض نافذة مشروطة
zh_hans: 显示 Modal

# viewThatFits.expected
source: SwiftUI expected: Candidate %@
ar: المتوقع في SwiftUI: المرشح %@
zh_hans: SwiftUI 预期：候选项 %@

# viewThatFits.height
source: Proposed height
ar: الارتفاع المقترح
zh_hans: 建议高度

# viewThatFits.intro
source: Resize the proposed width and height to verify candidate order, constrained axes, and fallback behavior against SwiftUI.ViewThatFits.
ar: غيّر العرض والارتفاع المقترحين للتحقق من ترتيب المرشحين والمحاور المقيدة وقاعدة الرجوع المتوافقة مع SwiftUI.ViewThatFits.
zh_hans: 调整建议宽高，验证候选顺序、约束轴和回退行为是否与 SwiftUI.ViewThatFits 一致。

# viewThatFits.next
source: Next scenario
ar: السيناريو التالي
zh_hans: 下一个场景

# viewThatFits.previous
source: Previous scenario
ar: السيناريو السابق
zh_hans: 上一个场景

# viewThatFits.selected
source: Observed: Candidate %@
ar: النتيجة الفعلية: المرشح %@
zh_hans: 实际结果：候选项 %@

# viewThatFits.width
source: Proposed width
ar: العرض المقترح
zh_hans: 建议宽度
